tap "homebrew-x/x"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jesseduffield/lazygit"
tap "tabbyml/tabby"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Yet Another Dotfiles Manager
brew "yadm"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Tabby: AI Coding Assitatnt
brew "tabbyml/tabby/tabby"
# Audio utility
cask "background-music"
# Desktop password and login vault
cask "bitwarden"
# Utility that prevents the system from going to sleep
cask "caffeine"
# App to build and share containerised applications and microservices
cask "docker"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-0xproto-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-3270-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-agave-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-anonymice-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-arimo-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-aurulent-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-bigblue-terminal-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-bitstream-vera-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-blex-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-caskaydia-cove-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-caskaydia-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-code-new-roman-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-comic-shanns-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-commit-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-cousine-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-d2coding-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-daddy-time-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-dejavu-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-droid-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-envy-code-r-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fantasque-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-geist-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-go-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-gohufont-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hasklug-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-heavy-data-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hurmit-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-im-writing-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-go-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-lgc-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-intone-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-term-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-term-slab-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-lekton-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-liberation-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-lilex-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-martian-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Japanese programming font synthesized from IBM Plex Mono and IBM Plex Sans JP
cask "font-plemol-jp"
# Japanese programming font synthesized from IBM Plex Mono and IBM Plex Sans JP
cask "font-plemol-jp-hs"
# Japanese programming font synthesized from IBM Plex Mono and IBM Plex Sans JP
cask "font-plemol-jp-nf"
# Developer targeted fonts with a high number of glyphs
cask "font-victor-mono-nerd-font"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Email client
cask "microsoft-outlook"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Pomodoro timer
cask "pomatez"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Block your own access to distracting websites
cask "selfcontrol"
# Instant messaging application focusing on security
cask "signal"
# Open source Spotify client
cask "spotube"
# Run commands and display their output on the desktop
cask "ubersicht"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
vscode "alefragnani.bookmarks"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "ardenivanov.svelte-intellisense"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "atlassian.atlascode"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "buenon.scratchpads"
vscode "calebporzio.better-phpunit"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "dineug.vuerd-vscode"
vscode "dustypomerleau.rust-syntax"
vscode "ecmel.vscode-html-css"
vscode "emanuelebartolesi.npm-info-lens"
vscode "equinusocio.vsc-community-material-theme"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.docker-explorer"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "hbenl.vscode-test-explorer"
vscode "hollowtree.vue-snippets"
vscode "humao.rest-client"
vscode "humy2833.ftp-simple"
vscode "jock.svg"
vscode "jspolancor.presentationmode"
vscode "k--kato.intellij-idea-keybindings"
vscode "mateocerquetella.xcode-12-theme"
vscode "mhutchie.git-graph"
vscode "michelemelluso.gitignore"
vscode "mksafi.find-jump"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "natizyskunk.sftp"
vscode "pkief.material-icon-theme"
vscode "player0.bocchi-the-rock"
vscode "qufiwefefwoyn.kanagawa"
vscode "rapidapi.vscode-services"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "runem.lit-plugin"
vscode "stylelint.vscode-stylelint"
vscode "svelte.svelte-vscode"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "vue.vscode-typescript-vue-plugin"
vscode "wayou.vscode-icons-mac"
vscode "wayou.vscode-todo-highlight"
vscode "wordpresstoolbox.wordpress-toolbox"
vscode "xdebug.php-pack"
vscode "zhuangtongfa.material-theme"
vscode "zobo.php-intellisense"
