tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "shivammathur/php"
brew "c-blosc"
brew "cmake"
brew "openldap"
brew "curl"
brew "freetds"
brew "libpq"
brew "php"
brew "composer"
brew "dbus"
brew "docker", link: false
brew "python@3.9"
brew "glib"
brew "gdk-pixbuf"
brew "geckodriver"
brew "ghostscript"
brew "libevent"
brew "unbound"
brew "gnutls"
brew "htop"
brew "httpd", link: false
brew "tcl-tk"
brew "libheif"
brew "imagemagick"
brew "jansson"
brew "libconfig"
brew "libiconv"
brew "libnotify"
brew "lua"
brew "mysql"
brew "neovim"
brew "netcat"
brew "node"
brew "netlify-cli"
brew "nghttp2"
brew "nmap"
brew "nvm"
brew "openjdk"
brew "openjdk@11"
brew "phpunit"
brew "qrencode"
brew "rom-tools"
brew "signal-cli"
brew "sqlmap"
brew "telnet"
brew "tmux"
brew "wget"
brew "wimlib"
brew "yarn"
brew "heroku/brew/heroku"
cask "chromium"
cask "font-fira-code"
cask "gimp"
cask "mutespotifyads"
cask "pennywise"
cask "rectangle"
cask "visual-studio-code"
